## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_compute_network.vpc_network will be created
+   resource "google_compute_network" "vpc_network" {
+       auto_create_subnetworks         = true
+       delete_default_routes_on_create = false
+       gateway_ipv4                    = (known after apply)
+       id                              = (known after apply)
+       internal_ipv6_range             = (known after apply)
+       mtu                             = (known after apply)
+       name                            = "terraform-network"
+       project                         = (known after apply)
+       routing_mode                    = (known after apply)
+       self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
